const all_Cards = [
    // Для всех типов кожи
    
    [//COMFORT ZONE
        {
            brand: "COMFORT ZONE",
            price: 2650,
            imgSrc: ["../img/items/face/1.jpg"],
            description: 'Лосьон микропилинг SUBLIME SKIN',
            fullDescription: "Лосьон-пилинг для деликатного и постепенного микроотшелушивания. Повышает восприимчивость кожи к последующим продуктам ухода, выравнивает тон. Подходит для ежедневного применения на коже любого типа. <br><br>Италия, 100 мл",
            id: 1
        }
    ],
    [ //DAVINES
        {
            brand: "Davines",
            price: 2650,
            imgSrc: ["../img/items/face/2.jpg"],
            description: 'SU СОЛНЦЕЗАЩИТНЫЙ КРЕМ С SPF 30.',
            fullDescription: "Солнцезащитный крем обеспечивает защиту от UVA/UVB лучей и обладает водоотталкивающими свойствами. Увлажняет и защищает кожу, препятствует первым признакам фотостарения. Подходит для лица и тела. <br><br> Не содержит силиконов, парабенов и минеральных масел, легко впитывается. <br><br>Объем: 100 мл.",
            id: 1
        }
    ],
    [ //La Sultane de Saba
        {
            brand: "La Sultane de Saba",
            price: 2650,
            imgSrc: ["../img/items/face/3.jpg"],
            description: 'Гоммаж Аюрведический La Sultane de Saba',
            fullDescription: "Гоммаж аюрведический с опьяняющим ароматом пачули, амбры и ванили нежно очищает и эксфолиирует кожу, активно усиливает капиллярное кровообращение.После применения Гоммажа кожа становится гладкой, мягкой и светящейся.Подходит для всех типов кожи, включая самую чувствительную. <br><br> 300 мл.",
            id: 1
        }
    ],
    [ //LIGNE ST BARTH
        {
            brand: "LIGNE ST BARTH",
            price: 2650,
            imgSrc: ["../img/items/face/4.jpg","../img/items/face/41.jpg","../img/items/face/42.jpg"],
            description: 'Драгоценное натуральное масло авокадо для лица, тела и волос.',
            fullDescription: 'ЧТО ТАКОЕ?<br>Драгоценное натуральное масло авокадо набрасывает на кожу и волосы роскошную золотистую бьюти-вуаль с бархатистым мерцанием. При нанесении до и после использования шампуня Масло восстанавливает блеск волос, разглаживает и облегчает расчёсывание. <br><br> ДЛЯ ЧЕГО?<br>Его можно наносить утром, вечером и в течение дня; оно прекрасно распределяется, быстро впитывается, обеспечивает надёжную защиту и дарит комфорт. Этот универсальный эликсир красоты с нежнейшим экзотическим ароматом тропического цветка тиаре творит настоящие чудеса, когда дело касается зрелой кожи.Масло авокадо для ухода за кожей лица, тела и волосами раскрывает своё благотворное воздействие как при нанесении, так и при добавлении в воду для ванны. Ещё один бонус: это идеальное средство для профилактики образования растяжек. <br><br>ПОЧЕМУ? Богатое витаминами A, D и E, лецитином и калием, это масло первого холодного отжима более чем на 20% состоит из ненасыщенных и насыщенных жирных кислот. <br>Масло богато стеаринами, которые известны своим свойством уменьшать возрастную пигментацию. Кроме того, оно ускоряет заживление кожи при солнечных ожогах и иных поверхностных повреждениях. Содержащиеся в масле растительные стеариновые кислоты делают кожу мягкой, гладкой и стимулируют способность эпидермиса удерживать влагу. Благодаря своей консистенции масло авокадо проникает в глубокие слои кожи.<br></br>Оно чрезвычайно эффективно способствует регенерации и обновлению клеток, поэтому оптимально подходит для обезвоженной и зрелой кожи, либо для кожи, поврежденной или подвергающейся воздействиям солнца и климатических изменений. Масло авокадо также успокаивает раздраженную кожу, помогает при псориазе и экземе. <br> Исследования израильского технологического института «Technion», проводившиеся в 1991 году, показали, что масло авокадо существенно повышает содержание коллагена в коже, выработка которого обычно сокращается с возрастом. <br><br>Объем 200мл.',
            id: 1
        }
    ],
    [ //Luxancee
        {
            brand: 'Luxancee',
            price: 2650,
            imgSrc: ["../img/items/face/5.jpg","../img/items/face/51.jpg","../img/items/face/52.jpg","../img/items/face/53.jpg","../img/items/face/54.jpg","../img/items/face/55.jpg"],
            description: 'Love кондиционер для усиления завитка, 250 ml',
            fullDescription: 'Гидрогелевые маски Luxancee сделаны из уникального материала, который создавался для клиники пластической хирургии. Предназначены для омоложения, глубокого питания и увлажнения. Сочетание растительных веществ и активных белковых компонентов даёт роскошное сияние коже. Уникальные свойства ионов золота регенерируют кожу и облегчают вывод токсинов. Алмазная пудра обеспечивает лёгкий пилинг.Мгновенный эффект лифтинга, устраняет чувство сухости и стянутости. Подходит для всех типов кожи. Гипоаллергенна.<br><br>Область применения: Для лица<br>Тип средства: Маска<br>Тип кожи: Для всех типов кожи<br>Действие: Увлажнение<br>Действие: Питание<br>Страна: Корея',
            id: 1
        }
    ],
    [ //MAD 
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/6.jpg"],
            description: 'Mega Rich Antioxidant Cleansing Gel — Очищающий гель, обогащенный антиоксидантами, 200 мл.',
            fullDescription: "Специальный очищающий гель для деликатного удаления макияжа, с высокой степенью антиоксидантной защиты. Нежно удаляет макияж и жирорастворимые загрязнения, не нарушая барьерных функций кожи. Экстракты зеленого, белого и красного чая, клюквы защищают от повреждения свободными радикалами и оказывают противовоспалительное действие. Экстраты яблок и филодендрона смягчают и увлажняют кожу, препятствуя ее преждевременному старению. Не содержит парабены и химические красители. <br><br>200 мл",
            id: 1
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/7.jpg"],
            description: 'Everyday Renewing Toner — Тоник с эффектом регенерации кожи, 200 мл.',
            fullDescription: "Тоник для глубокого увлажнения, питания и регенерации кожи. Выравнивает РН кожи и идеально подготавливает ее к дальнейшему нанесению активных компонентов, значительно улучшая их проникновение. Комплекс мульти-фруктовых кислот мягко обновляют кожу и препятствуют появлению гиперкератоза. Экстракты зеленого, белого и красного чая предупреждают повреждение свободными радикалами. Экстракты Арники и Календулы успокаивают кожу и устраняют покраснения и раздражения кожи. Unirepair T-43 — запатентованный комплекс аминокислот предупреждает повреждение клеток кожи УФ излучением и способствует их восстановлению. <br><br>200 мл",
            id: 2
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/8.jpg"],
            description: 'Saturday Night Transformation Primer — Крем-основа под макияж «Моментальный эффект», 30 г',
            fullDescription: "Легкий крем-основа под макияж моментально выравнивает текстуру кожи и препятствует ее возрастным изменениям. Кожа выглядит более гладкой, молодой и подтянутой. Пальмитоил Гексапептид-12 укрепляет и восстанавливает структуру кожи, уменьшает выраженность морщин и линий. Dermaxyl — улучшает синтез коллагена и укрепляет кожу. BVOSC — концентрированная форма витамина С, оказывает мощное антиоксидантное действие , стимулирует синтез коллагена, ускоряет пролиферацию клеток и препятствует появлению пигментации. Lavandox — обеспечивает быстрое и заметное уменьшение выраженности морщин и придает гладкость коже. Церамиды 2 — восстанавливают баланс влаги в коже. Экстракт лаванды и фитостеролы восстанавливают поврежденную кожу, оказывают противовоспалительное и успокаивающее действие. <br><br>30 г",
            id: 3
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/9.jpg"],
            description: 'Eye Defense Shielding Serum — Защитная сыворотка для глаз «Антистресс», 15 гр.',
            fullDescription: "Легкая сыворотка-корректор, предназначенная для защиты, гидратации и питания тонкой кожи в области глаз. А также минимизации мелких морщин вокруг глаз. Благодаря специальной «шелковой» текстуре происходит мгновенное выравнивание рельефа кожи и морщинки становятся менее заметными. Prodew 400 — уникальный комплекс обеспечивает глубокое увлажнение и повышает эластичность кожи. CELLDETOX® усиливает процесс детоксикации клеток кожи, снижая уровень окисленых белков и липидов. Уменьшает видимые признаки старения и восстанавливает естественное сияние кожи. Oxygeskin® восстанавливает способность клеток реагировать на гипоксический стресс и помогает внутриклеточной диффузии кислорода. Этот двойной механизм способствует оксигенации кожи и ведет к выравниванию поверхности кожи и приданию ей сияния. Shact Bact Peptide защитный гексапептид (CHDPs) с высокой антимикробной активностью, обеспечивает антибактериальное воздействие. SYN®-COLL стимулирует синтез коллагена и предотвращает его деградацию. <br><br>15 г",
            id: 4
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/10.jpg"],
            description: 'Youth Transformation Exfoliating Serum 10% AHA — Омолаживающая и обновляющая сыворотка с 10% AHA кислотами, 30 г',
            fullDescription: "Сыворотка для интенсивного омоложения и обновления кожи на основе 10% АХА кислот, комплекса из 8 аминокислот, растительных экстрактов и витаминов. Уникальная комбинация эксфолиирующих, питательных и увлажняющих компонентов позволяет в короткие сроки улучшить текстуру и рельеф кожи, а также добиться визуально выраженного омолаживающего эффекта. Сыворотка предотвращает преждевременное старение кожи. Кожа становится более гладкой, упругой и сияющей, морщинки, линии и пигментация менее заметными. Multifruit® BSC — инновационный комплекс , содержащий альфа-гидроксикислоты, полученные из экстрактов черники, сахарного тростника, сахарного клена, апельсина и лимона, способствует увеличению скорости обновления клеток кожи и препятствует появлению гиперкератоза. Гликолевая кислота — обеспечивает увлажнение и значительное улучшение текстуры кожи. Prodew 400 – обеспечивает сверхэффективное увлажнение кожи и повышает ее упругость. Пантенол — борется с воспалениями и повышенной чувствительностью кожи, устраняет раздражения, глубоко увлажняет и смягчает кожу. Гиалуронат натрия 1% — препятствует потере влаги в коже и уменьшает её сухость и огрубение. Удерживает влагу в коже и уменьшает её трансэпидер­мальную потерю (TEWL), визуально наполняет кожу и делает менее за­метными морщины. <br><br> 30 г",
            id: 5
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/11.jpg"],
            description: 'Illuminating Daily Moisturizer — Дневной увлажняющий крем с эффектом выравнивания тона кожи, 50 гр.',
            fullDescription: "Крем для восстановления и осветления пигментированной кожи на основе тройного комплекса стабильных форм витамина С, пептидов, витаминов, растительных масел и экстрактов. Крем эффективно защищает кожу от хроно- и фотостарения, предупреждает появление пигментации и воспалений. Значительно выравнивается тон кожи, укрепляются сосуды, повышается ее гладкость. ß-White™ инновационный инкапсулированный биомиметический пептид нормализует процесс меланогенеза, предупреждает появление пигментации и эффективно осветляет кожу. Ниацинамид улучшает микроциркуляцию, обеспечивает мощное клеточное обновление, улучшает эластичность кожи и ее барьерную функцию, осветляет и удаляет возрастные пятна, выравнивает текстуру и рельеф кожи. Nano LDP’s Lightening специальные фосфолипидные сферы содержащие аскорбил фосфат натрия, стимулируют синтез коллагена, осветляют пигментацию и предупреждают появление фотоповреждений. BVOS-C, Stay-C® 50 и МАР, стабильные жиро и водорастворимые формы витамина С , защищают кожу от фотостарения восстанавливают ее, препятствуют повреждению кожи свободными радикалами, эффективно осветляют пигментацию и стимулируют синтез коллагена. Экстракты солодки и эмблики осветляют пигментные пятна и выравнивают тон кожи. Масла абрикоса, бергамота, бузины черной смородины питают и восстанавливают эластичность кожи, предотвращают появление гиперкератоза. <br><br> 50 г",
            id: 6
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/12.jpg"],
            description: 'Redness Rescue — Гель для устранения покраснения кожи',
            fullDescription: "Легкий успокаивающий гель для эффективной защиты, быстрого устранения покраснений и раздражений кожи. Растительные стволовые клетки кипрея узколистного повышают жизнеспособность клеток дермы и оказывают выраженное противовоспалительное действие. Экстракты водяной лилии, хмеля, мелиссы, алоэ и розмарина увлажняют, смягчают и устраняют покраснение кожи. Бета-глюкан оказывает заживляющее, противовоспалительное и увлажняющее действие, эффективно устраняет покраснения и раздражения кожи. Palmitoyl Tripeptide-8 подавляет процесс выработки медиаторов воспаления, уменьшает проницаемость сосудов и оказывает мощное противовоспалительное действие. Sepicalm™ VG успокаивает, увлажняет и смягчает кожу в т.ч. после избыточной инсоляции. Sedaplant Richter запатентованный растительный комплекс, ускоряет процесс заживления кожи. Neutrazen™ восстанавливает нормальный порог чувствительности кожи и устраняет признаки воспаления кожи. Гиалуроновая кислота увлажняет и способствует устранению сухости и стянутости кожи. <br><br> 30 г",
            id: 7
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/13.jpg"],
            description: 'Hyper Sheer SPF 50 Daily Moisturizer — Увлажняющий крем-основа под макияж с защитой SPF 50, 50 гр.',
            fullDescription: "Увлажняющий крем с эффектом защиты от агрессивного воздействия окружающей среды и солнца. Содержит физический Zinc Oxide 9% и химический Octylmethoxycinnamate 7.5% фотофильтры, эффективно защищающие от солнечных лучей. Oxynex К — cпециальный ингредиент обеспечивает максимальную антиоксидантную защиту от свободных радикалов и помогает бороться с видимыми признаками старения кожи. Восстанавливает ее естественное сияние, выводит токсины и устраняет эффект усталой кожи. Экстракты Маракуйи и Кресса интенсивно увлажняют и восстанавливают кожу, защищают от окислительного стресса, оказывают антибактериальное действие и устраняют покраснения, успокаивают раздраженную кожу. BVOSC — концентрированная форма витамина С с высокой биодоступностью, оказывает мощное антиоксидантное действие , стимулирует синтез коллагена, ускоряет пролиферацию клеток и препятствует появлению пигментации. Крем эффективно защищает кожу от био-загрязнений и солнечных лучей, а также улучшает ее способность противостоять агрессии окружающей среды.Не содержит парабенов и химических красителей. ПРИМЕНЕНИЕ: Очистите лицо с помощью соответствующего очищающего средства. Протонизируйте кожу. Нанесите небольшое количество крема на кожу лица, шеи и декольте, равномерно распределите. Используйте утром перед нанесением макияжа. <br><br> 50 г",
            id: 8
        }
    ],

    [ //ST BARTH VISAGE
        {
            brand: "ST BARTH VISAGE",
            price: 2650,
            imgSrc: ["../img/items/face/14.jpg"],
            description: 'КРЕМ С ЭКСТРАКТОМ МАНГО MANGO BUTTER CREAM',
            fullDescription: "Увлажнение & защита<br>Великолепно увлажняющий крем против морщин для всех типов кожи<br><br> Объем: 50 г",
            id: 1
        }
    ],
    [ //ULTRACEUTICALS
        {
            brand: "ULTRACEUTICALS",
            price: 2650,
            imgSrc: ["../img/items/face/15.jpg"],
            description: 'Ультра очищающее молочко Ultra hydrating milk cleanser',
            fullDescription: "Очищающее молочко подходит для всех типов кожи, особенно для сухой и чувствительной.Действие:-мягко очищает и восстанавливает гидролипидный барьер-подходит для снятия макияжа с глаз-смягчает и оказывает успокаивающее действие-уровень pH 5,5<br><br>200 мл",
            id: 1
        },
        {
            brand: "ULTRACEUTICALS",
            price: 2650,
            imgSrc: ["../img/items/face/16.jpg"],
            description: 'Ультра мягкий отшелушивающий гель Ultra gentle exfoliating gel',
            fullDescription: "Мягко отшелушивает кожу, не раздражая ее. Обновляет и выравнивает тон и рельеф кожи.Для всех типов кожи.<br><br>200 мл",
            id: 2
        },
        {
            brand: "ULTRACEUTICALS",
            price: 2650,
            imgSrc: ["../img/items/face/17.jpg"],
            description: 'Ультра увлажняющий спрей для лица ULTRA HYDRATING SKIN MIST',
            fullDescription: "Многофункциональный спрей успокаивает, освежает, смягчает кожу, а также обладает антиоксидантным действием.Для всех типов кожи.<br><br> 45/150 мл",
            id: 3
        },
        {
            brand: "ULTRACEUTICALS",
            price: 2650,
            imgSrc: ["../img/items/face/18.jpg"],
            description: 'Питательный кондиционер для защиты и сияния ',
            fullDescription: "Многофункциональный спрей успокаивает, освежает, смягчает кожу, а также обладает антиоксидантным действием.Для всех типов кожи. <br><br>45/150 мл",
            id: 4
        },
        {
            brand: "ULTRACEUTICALS",
            price: 2650,
            imgSrc: ["../img/items/face/19.jpg"],
            description: 'Ультра мягкое средство для снятия макияжа с глаз Ultra soothing eye make-up remover',
            fullDescription: "Двухфазное средство для снятия макияжа. Для всех типов кожи, включая чувсвительную. <br><br>130 мл",
            id: 5
        }
    ],
    // Жирная кожа
    [ 
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/20.jpg"],
            description: 'Breakout Control Daily Moisturizer — Увлажняющий крем с эффектом устранения раздражений, 50 гр.',
            fullDescription: "Легкий ежедневный увлажняющий крем для ухода за жирной и комбинированной кожей, а также для кожи с проявлениями АКНЕ.<br>Эффективно контролирует процесс гиперсекреции кожного сала, устраняет жирный блеск и успокаивает раздраженную кожу.<br>Благодаря чему кожа выглядит более гладкой, жирный блеск становится менее заметным, устраняется эффект раздраженной и обезвоженной кожи.<br>Масло чайного дерева — оказывает антибактериальное действие. <br>Alp Sebum — инновационный ингредиент оказывает мощное противовоспалительное действие, подавляет гиперсекрецию кожного сала и уменьшает визуальную выраженность пор.<br>Масло перечной мяты — смягчает и успокаивает раздраженную кожу.<br>Экстракт корня имбиря — улучшает микроциркуляцию и препятствует появлению застойных воспалений и пигментных пятен, значительно ускоряет процесс заживления кожи.<br>Экстракт гаммамелиса — оказывает вяжущее действие, способствует сужению пор и оздоровлению состояния кожи.<br><br>50 гр",
            id: 1
        },
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/21.jpg"],
            description: 'Acne Drying Lotion w Sulfur 10% — Подсушивающий лосьон с 10% серой, 30 мл.',
            fullDescription: "Специальный лосьон для локального использования.Быстро устраняет воспаление и подсушивает кожу в области воспалительного элемента.<br>Средство эффективно борется с имеющимися воспалительными элементами и предупреждает появление новых.<br>Салициловая кислота, бета-гидрокси кислота — отшелушивают омертвевшие клетки, подсушивают, устраняют воспаления и комедоны.<br>Сера 10% — подавляет гиперсекрецию сальных желез и обладает антибактериальным действием.<br>Камфора — оказывает антибактериальное действие, устраняет раздражения и снижает чувствительность кожи, успокаивает и обеспечивает охлаждающий эффект.<br>Цинк — способствует заживлению, успокаивает и подсушивает кожу.<br><br>30 мл",
            id: 2
        }
    ],
    // Нормальная кожа
    [ 
        {
            brand: "COMFORT ZONE",
            price: 2650,
            imgSrc: ["../img/items/face/22.jpg"],
            description: 'Крем увлажняющий HYDRAMEMORY',
            fullDescription: "Невесомый крем с гиалуроновой кислотой и смесью натуральных экстрактов насыщает кожу влагой, дарит приятное ощущение свежести и глубокого увлажнения.Для нормальной и сухой кожи, а также в условиях умеренного и холодного климата.<br><br>60 мл ",
            id: 1
        }
    ],
    // Омолаживание
    [
        {
            brand: "COMFORT ZONE",
            price: 2650,
            imgSrc: ["../img/items/face/23.jpg"],
            description: 'Лифтинг-маска мгновенного действия SUBLIME SKIN',
            fullDescription: "Лифтинг-маска с мгновенным омолаживающим действием обеспечивает сияние и гладкость. Подтягивает и дарит коже красивое сияние.Идеально подходит коже с признаками усталости, старения и при повышенной отечности.<br><br>Италия, 60 мл",
            id: 1
        },
        {
            brand: "COMFORT ZONE",
            price: 2650,
            imgSrc: ["../img/items/face/24.jpg"],
            description: 'Омолаживающий питательный лифтинг-крем SUBLIME SKIN Sublime skin rich cream',
            fullDescription: "Сверхпитательный восстанавливающий крем, специально разработанный для борьбы с чрезмерной сухостью и обезвоженностью. Насыщенная текстура и инновационная формула мгновенно придают коже сияние, возвращают упругость и борются с признаками старения.Идеальное средство для зрелой и/ или очень сухой кожи.",
            id: 2
        }
    ],
    // Сухая кожа
    [
        {
            brand: "COMFORT ZONE",
            price: 2650,
            imgSrc: ["../img/items/face/25.jpg"],
            description: 'Крем увлажняющий HYDRAMEMORY',
            fullDescription: "Невесомый крем с гиалуроновой кислотой и смесью натуральных экстрактов насыщает кожу влагой, дарит приятное ощущение свежести и глубокого увлажнения.Для нормальной и сухой кожи, а также в условиях умеренного и холодного климата.<br><br>60 мл",
            id: 1
        },
        {
            brand: "COMFORT ZONE",
            price: 2650,
            imgSrc: ["../img/items/face/26.jpg"],
            description: 'Маска увлажняющая HYDRAMEMORY',
            fullDescription: "SOS-маска с гиалуроновой кислотой для моментального увлажнения кожи. Дает видимый результат всего за несколько минут - наполненная, мягкая и гладкая кожа.Рекомендуется в случае сухой, стрессированной кожи. Идеальна после путешествия или в холодных, резких климатах.<br><br>Италия, 60 мл",
            id: 2
        },
        {
            brand: "COMFORT ZONE",
            price: 2650,
            imgSrc: ["../img/items/face/27.jpg"],
            description: 'Омолаживающий питательный лифтинг-крем SUBLIME SKIN Sublime skin rich cream',
            fullDescription: "Сверхпитательный восстанавливающий крем, специально разработанный для борьбы с чрезмерной сухостью и обезвоженностью. Насыщенная текстура и инновационная формула мгновенно придают коже сияние, возвращают упругость и борются с признаками старения.Идеальное средство для зрелой и/ или очень сухой кожи.",
            id: 3
        }
    ],
    // Чувствительная кожа
    [
        {
            brand: "M.A.D",
            price: 2650,
            imgSrc: ["../img/items/face/28.jpg"],
            description: 'Delicate Skin Cleansing Gel — Очищающий гель для чувствительной кожи, 200 мл.',
            fullDescription: "Нежный гель для деликатного очищения кожи на основе мягких ПАВов, растительных экстрактов и аминокислот. Гель тщательно очищает кожу от поверхностных загрязнений и макияжа, не сушит и не раздражает кожу. Prodew 400 — инновационный комплекс обеспечивает сверхэффективное увлажнение кожи и повышает ее упругость. Экстракт солодки — успокаивает раздраженную и чувствительную кожу, предупреждает появление пигментации. Экстракт ромашки, лаванды и алоэ — оказывают противовоспалительное действие и успокаивают кожу. Комплекс аминокислот — насыщает кожу энергией, ускоряет заживление и увлажняет кожу. Для любого типа кожи. Нанесите гель на влажные руки и распределите по лицу, шее и декольте. Помассируйте 1-2 мин. Остатки удалите теплой водой.<br><br>200 мл",
            id: 1
        }
    ]
]


// 

const brand_Сards = document.querySelectorAll('.brand__cards');
const brand_СardsMass = [];
brand_Сards.forEach((element) => {
    brand_СardsMass.push(element)
});

// 


for (let k = 0; k < brand_СardsMass.length; k++) {
    const dataMass = all_Cards[k];
    const dataBrandCard = brand_СardsMass[k];
    renderCards(dataMass, dataBrandCard)
}

// const brandCards = document.querySelector('.brand__cards');


function renderCards(typeMass, dataCards) {


    // проходим по каждому объекту в массиве cards
    typeMass.forEach(card => {
        // создаем новый элемент карточки
        const newCard = document.createElement('div');

        newCard.classList.add('brand__card');
        newCard.id = card.id;
        newCard.setAttribute('onclick', 'openPopup(id, this)');
        // newCard

        // добавляем в него изображение
        const cardImg = document.createElement('div');
        cardImg.classList.add('card__img');
        const img = document.createElement('img');
        img.setAttribute('src', card.imgSrc[0]);
        img.setAttribute('alt', '');
        cardImg.appendChild(img);
        newCard.appendChild(cardImg);

        // добавляем в него цену
        // const cardPrice = document.createElement('div');
        // cardPrice.classList.add('card__price');
        // const price = document.createElement('span');
        // price.innerText = card.price;
        // cardPrice.appendChild(price);
        // const currency = document.createElement('span');
        // currency.innerText = '₽';
        // cardPrice.appendChild(currency);
        // newCard.appendChild(cardPrice);

        // добавляем в него бренд
        const brand = document.createElement('p');
        brand.classList.add('card__brand');
        brand.innerText = card.brand;
        newCard.appendChild(brand);

        // добавляем в него описание
        const description = document.createElement('p');
        description.classList.add('card__about');
        description.innerText = card.description;
        newCard.appendChild(description);

        // добавляем новую карточку в контейнер
        dataCards.appendChild(newCard);

    });
}


const overlay = document.querySelector('.overlay');
const popup = document.querySelector('.popup');
const popup__container = document.querySelector('.popup-container');
const bodyEl = document.querySelector('body');

function openPopup(id, hero) {
    // const popup = document.querySelector('.popup');
    // const bodyEl = document.querySelector('body');
    popup.classList.add('active');
    bodyEl.classList.add('popup-open');

    updatePopup(id, hero);
}


function closePopup() {
    popup.classList.remove('active');
    bodyEl.classList.remove('popup-open');
}


overlay.addEventListener('click', function (event) {
    const popup__container = document.querySelector('.popup-container');
    const isClickInsidePopup = popup__container.contains(event.target);
    // console.log(isClickInsidePopup);
    if (!isClickInsidePopup) {
        closePopup();
    }
});



// Актуализация инфы в модалке

const popupTitle = document.querySelector('.title');
const popupBrand = document.querySelector('.description__brand');
const popupName = document.querySelector('.description__name');
const popupAbout = document.querySelector('.description__about');
const popupPrice = document.querySelector('.priceRub');

const allCards = document.querySelectorAll('.brand__card');


function updatePopup(num, hero) {
    // let data = cards.find((card) => card.id == num){
    //   popupTitle.innerHTML
    // }
    const paretnBrandcards = hero.parentNode;
    // console.log(paretnBrandcards);

    let dataIdCard;
    for (let p = 0; p < brand_СardsMass.length; p++) {
        if (paretnBrandcards == brand_СardsMass[p]) {
            dataIdCard = p;
            // console.log(dataIdCard);
        }
    }
    all_Cards[dataIdCard].forEach(card => {
        if (card.id == num) {
            // const newPrice = card.querySelector('card-price');
            const cardId = num - 1;

            popupBrand.innerHTML = all_Cards[dataIdCard][cardId].brand;
            popupName.innerHTML = all_Cards[dataIdCard][cardId].description;
            popupAbout.innerHTML = all_Cards[dataIdCard][cardId].fullDescription;
            // popupPrice.innerHTML = all_Cards[dataIdCard][cardId].price;

        }
    })
    updateSlides(num - 1, all_Cards[dataIdCard]);
};




// Карусель настройка

const carouselInner = document.querySelector('.carousel-inner');
const carouselIndicators = document.querySelector('.carousel-indicators');

const leftArrow123 = document.querySelector('.carousel-control-prev');
const rightArrow123 = document.querySelector('.carousel-control-next');


function updateSlides(cardNumber, dataMasss) {
    carouselInner.innerHTML = '';

    const newCarouselItemActive = document.createElement('div');
    newCarouselItemActive.classList.add('carousel-item');
    newCarouselItemActive.classList.add('active');

    const newImgA = document.createElement('img');
    newImgA.setAttribute('class', 'd-block w-100');
    newImgA.setAttribute('alt', '...');
    newImgA.setAttribute('src', dataMasss[cardNumber].imgSrc[0]);
    newCarouselItemActive.appendChild(newImgA);
    carouselInner.appendChild(newCarouselItemActive);

    if (dataMasss[cardNumber].imgSrc.length > 1) {
        leftArrow123.classList.remove('hide');
        rightArrow123.classList.remove('hide');

        for (let i = 1; i < dataMasss[cardNumber].imgSrc.length; i++) {
            const newCarouselItem = document.createElement('div');
            newCarouselItem.classList.add('carousel-item');
            const newImg = document.createElement('img');
            newImg.setAttribute('class', 'd-block w-100');
            newImg.setAttribute('alt', '...');
            newImg.setAttribute('src', dataMasss[cardNumber].imgSrc[i]);
            newCarouselItem.appendChild(newImg);
            carouselInner.appendChild(newCarouselItem);
        }
    } else {
        leftArrow123.classList.add('hide');
        rightArrow123.classList.add('hide');
    }
}


