const all_Cards = [
    [
        {
            brand: "Nashi Argan",
            price: 3240,
            imgSrc: ["../img/items/Nashi Argan/1.png"],
            description: 'Шампунь балансирующий для кожи головы ARMONIA',
            fullDescription: "ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1",
            id: 1
        },
        {
            brand: "Kerastase",
            price: 4200,
            imgSrc: ["../img/items/Nashi Argan/2.png", "../img/items/Nashi Argan/2.png"],
            description: 'Шампунь Nutritive для сухих волос',
            fullDescription: "ТУТ ПОЛНОЕ ОПИСАНИЕ2 ТУТ ПОЛНОЕ ОПИСАНИЕ2 ТУТ ПОЛНОЕ ОПИСАНИЕ2 ТУТ ПОЛНОЕ ОПИСАНИЕ2",
            id: 2
        }
    ],
    [
        {
            brand: "Nashi Argan",
            price: 3240,
            imgSrc: ["../img/items/Nashi Argan/1.png"],
            description: 'Шампунь балансирующий для кожи головы ARMONIA',
            fullDescription: "ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1 ТУТ ПОЛНОЕ ОПИСАНИЕ1ТУТ ПОЛНОЕ ОПИСАНИЕ1",
            id: 1
        },
        {
            brand: "Kerastase",
            price: 4200,
            imgSrc: ["../img/items/Nashi Argan/2.png", "../img/items/Nashi Argan/2.png"],
            description: 'Шампунь Nutritive для сухих волос',
            fullDescription: "ТУТ ПОЛНОЕ ОПИСАНИЕ2 ТУТ ПОЛНОЕ ОПИСАНИЕ2 ТУТ ПОЛНОЕ ОПИСАНИЕ2 ТУТ ПОЛНОЕ ОПИСАНИЕ2",
            id: 2
        }
    ]
]